org/qmckl_nucleus.org
#i+TITLE: Nucleus
# +SETUPFILE: ../tools/theme.setup
# +INCLUDE: ../tools/lib.org

A ll the data relative to the molecular geometry is described here.

*  Headers                                                          :noexport:
   #+begin_src elisp :noexport :results none
( org-babel-lob-ingest "../tools/lib.org")
#+end_src


  #+begin_src c :tangle (eval h_private_type)
#ifndef QMCKL_NUCLEUS_HPT
#define QMCKL_NUCLEUS_HPT
#include <stdbool.h>
  #+end_src

  #+begin_src c :tangle (eval c_test) :noweb yes
#include "qmckl.h"
#include <assert.h>
#include <stdio.h>
#include <math.h>
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif
int main() {
  qmckl_context context;
  context = qmckl_context_create();
  #+end_src

  #+begin_src c :tangle (eval c)
#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#ifdef HAVE_STDINT_H
#include <stdint.h>
#elif HAVE_INTTYPES_H
#include <inttypes.h>
#endif

#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <assert.h>
#include <math.h>

#include <stdio.h>

#include "qmckl.h"
#include "qmckl_context_private_type.h"
#include "qmckl_memory_private_type.h"
#include "qmckl_memory_private_func.h"
#include "qmckl_nucleus_private_func.h"
  #+end_src

* Context

  The following data stored in the context:

   | ~uninitialized~    | int32_t          | Keeps bit set for uninitialized data                |
   | ~num~              | int64_t          | Total number of nuclei                              |
   | ~provided~         | bool             | If true, ~nucleus~ is valid                         |
   | ~charge~           | double[num]      | Nuclear charges                                     |
   | ~coord~            | double[3][num]   | Nuclear coordinates                                 |
   | ~nn_distance~      | double[num][num] | Nucleus-nucleus distances                           |
   | ~nn_distance_date~ | int64_t          | Date when Nucleus-nucleus distances were computed   |
   | ~repulsion~        | double           | Nuclear repulsion energy                            |
   | ~repulsion_date~   | int64_t          | Date when the nuclear repulsion energy was computed |

** Data structure

   #+begin_src c :comments org :tangle (eval h_private_type)
typedef struct qmckl_nucleus_struct {
  int64_t   num;
  int64_t   repulsion_date;
  int64_t   nn_distance_date;
  double*   coord;
  double*   charge;
  double*   nn_distance;
  double    repulsion;
  int32_t   uninitialized;
  bool      provided;
} qmckl_nucleus_struct;
   #+end_src

   The ~uninitialized~ integer contains one bit set to one for each
   initialization function which has not bee called. It becomes equal
   to zero after all initialization functions have been called. The
   struct is then initialized and ~provided == true~.

** Access functions

   #+begin_src c :comments org :tangle (eval h_func) :exports none
qmckl_exit_code qmckl_get_nucleus_num         (const qmckl_context context, int64_t* num);
qmckl_exit_code qmckl_get_nucleus_charge      (const qmckl_context context, double* charge);
qmckl_exit_code qmckl_get_nucleus_coord       (const qmckl_context context, double* coord);
   #+end_src

   #+NAME:post
   #+begin_src c  :exports none
if ( (ctx->nucleus.uninitialized & mask) != 0) {
  return NULL;
}
   #+end_src

   #+begin_src c :comments org :tangle (eval c) :noweb yes :exports none
qmckl_exit_code
qmckl_get_nucleus_num (const qmckl_context context, int64_t* num) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return QMCKL_INVALID_CONTEXT;
  }

  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);

  int32_t mask = 1 << 0;

  if ( (ctx->nucleus.uninitialized & mask) != 0) {
    return QMCKL_NOT_PROVIDED;
  }

  assert (ctx->nucleus.num >= (int64_t) 0);
  ,*num = ctx->nucleus.num;

  return QMCKL_SUCCESS;
}


qmckl_exit_code
qmckl_get_nucleus_charge (const qmckl_context context, double* charge) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return QMCKL_INVALID_CONTEXT;
  }

  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);

  int32_t mask = 1 << 1;

  if ( (ctx->nucleus.uninitialized & mask) != 0) {
    return QMCKL_NOT_PROVIDED;
  }

  assert (ctx->nucleus.charge != NULL);

  int64_t nucl_num;
  qmckl_exit_code rc;
  rc = qmckl_get_nucleus_num(context, &nucl_num);
  if (rc != QMCKL_SUCCESS) return rc;
  
  double* result = memcpy(charge, ctx->nucleus.charge, nucl_num*sizeof(double));
  if (result == NULL) return QMCKL_FAILURE;
  
  return QMCKL_SUCCESS;
}


qmckl_exit_code
qmckl_get_nucleus_coord (const qmckl_context context, double* coord) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return QMCKL_INVALID_CONTEXT;
  }
  
  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);
  
  int32_t mask = 1 << 2;

  if ( (ctx->nucleus.uninitialized & mask) != 0) {
    return QMCKL_NOT_PROVIDED;
  }

  int64_t nucl_num;
  qmckl_exit_code rc;
  rc = qmckl_get_nucleus_num(context, &nucl_num);
  if (rc != QMCKL_SUCCESS) return rc;
  
  assert (ctx->nucleus.coord != NULL);

  double* result = memcpy(coord, ctx->nucleus.coord, 3*nucl_num*sizeof(double));
  if (result == NULL) return QMCKL_FAILURE;
  
  return QMCKL_SUCCESS;
}
   #+end_src

   When all the data relative to nuclei have been set, the following
   function returns ~true~.

   #+begin_src c :comments org :tangle (eval h_func)
bool qmckl_nucleus_provided (const qmckl_context context);
   #+end_src

   #+begin_src c :comments org :tangle (eval c) :noweb yes :exports none
bool qmckl_nucleus_provided(const qmckl_context context) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return false;
  }

  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);

  return ctx->nucleus.provided;
}
   #+end_src

