qmckl_nucleus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-15 Sat 23:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org791b593">1. Context</a>
<ul>
<li><a href="#org660447e">1.1. Data structure</a></li>
<li><a href="#orgfcff5f3">1.2. Access functions</a></li>
<li><a href="#orgea7e904">1.3. Initialization functions</a></li>
<li><a href="#org203c8f5">1.4. Test</a></li>
</ul>
</li>
<li><a href="#orga0d3283">2. Computation</a>
<ul>
<li><a href="#org6cd5f26">2.1. Nucleus-nucleus distances</a>
<ul>
<li><a href="#orgcd546bf">2.1.1. Get</a></li>
<li><a href="#org85b7eb4">2.1.2. Compute</a></li>
<li><a href="#org48a2dd8">2.1.3. Test</a></li>
</ul>
</li>
<li><a href="#orgf571366">2.2. Nuclear repulsion energy</a>
<ul>
<li><a href="#orgc9f40da">2.2.1. Get</a></li>
<li><a href="#org63cabf9">2.2.2. Compute</a></li>
<li><a href="#orge762106">2.2.3. Test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#i+TITLE: Nucleus
</p>

<p>
A ll the data relative to the molecular geometry is described here.
</p>

<div id="outline-container-org791b593" class="outline-2">
<h2 id="org791b593"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
<p>
The following data stored in the context:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>uninitialized</code></td>
<td class="org-left">int32<sub>t</sub></td>
<td class="org-left">Keeps bit set for uninitialized data</td>
</tr>

<tr>
<td class="org-left"><code>num</code></td>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">Total number of nuclei</td>
</tr>

<tr>
<td class="org-left"><code>provided</code></td>
<td class="org-left">bool</td>
<td class="org-left">If true, <code>nucleus</code> is valid</td>
</tr>

<tr>
<td class="org-left"><code>charge</code></td>
<td class="org-left">double[num]</td>
<td class="org-left">Nuclear charges</td>
</tr>

<tr>
<td class="org-left"><code>coord</code></td>
<td class="org-left">double[3][num]</td>
<td class="org-left">Nuclear coordinates</td>
</tr>

<tr>
<td class="org-left"><code>nn_distance</code></td>
<td class="org-left">double[num][num]</td>
<td class="org-left">Nucleus-nucleus distances</td>
</tr>

<tr>
<td class="org-left"><code>nn_distance_date</code></td>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">Date when Nucleus-nucleus distances were computed</td>
</tr>

<tr>
<td class="org-left"><code>repulsion</code></td>
<td class="org-left">double</td>
<td class="org-left">Nuclear repulsion energy</td>
</tr>

<tr>
<td class="org-left"><code>repulsion_date</code></td>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">Date when the nuclear repulsion energy was computed</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org660447e" class="outline-3">
<h3 id="org660447e"><span class="section-number-3">1.1</span> Data structure</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_nucleus_struct</span> {
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">num</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">repulsion_date</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">nn_distance_date</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">coord</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">charge</span>;
  <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">nn_distance</span>;
  <span style="color: #228b22;">double</span>    <span style="color: #a0522d;">repulsion</span>;
  <span style="color: #228b22;">int32_t</span>   <span style="color: #a0522d;">uninitialized</span>;
  <span style="color: #228b22;">bool</span>      <span style="color: #a0522d;">provided</span>;
} <span style="color: #228b22;">qmckl_nucleus_struct</span>;
</pre>
</div>

<p>
The <code>uninitialized</code> integer contains one bit set to one for each
initialization function which has not bee called. It becomes equal
to zero after all initialization functions have been called. The
struct is then initialized and <code>provided == true</code>.
</p>
</div>
</div>

<div id="outline-container-orgfcff5f3" class="outline-3">
<h3 id="orgfcff5f3"><span class="section-number-3">1.2</span> Access functions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
When all the data relative to nuclei have been set, the following
function returns <code>true</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span> <span style="color: #0000ff;">qmckl_nucleus_provided</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>);
</pre>
</div>
</div>
</div>
