org/qmckl_nucleus.org
** Initialization functions

   To set the data relative to the nuclei in the context, the
   following functions need to be called.

   #+begin_src c :comments org :tangle (eval h_func)
qmckl_exit_code  qmckl_set_nucleus_num    (qmckl_context context, const int64_t num);
qmckl_exit_code  qmckl_set_nucleus_charge (qmckl_context context, const double* charge);
qmckl_exit_code  qmckl_set_nucleus_coord  (qmckl_context context, const double* coord);
   #+end_src

   #+NAME:pre2
   #+begin_src c :exports none
if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
  return QMCKL_NULL_CONTEXT;
 }

qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
   #+end_src

   #+NAME:post2
   #+begin_src c :exports none
ctx->nucleus.uninitialized &= ~mask;
ctx->nucleus.provided = (ctx->nucleus.uninitialized == 0);

return QMCKL_SUCCESS;
   #+end_src


   To set the number of nuclei, use
   
   #+begin_src c :comments org :tangle (eval c) :noweb yes  :exports none
qmckl_exit_code
qmckl_set_nucleus_num(qmckl_context context, const int64_t num) {
  <<pre2>>

  if (num <= 0) {
    return qmckl_failwith( context,
                           QMCKL_INVALID_ARG_2,
                           "qmckl_set_nucleus_num",
                           "num <= 0");
  }

  int32_t mask = 1;

  ctx->nucleus.num = num;

  <<post2>>
}
   #+end_src

    The following function sets the nuclear charges of all the atoms. 

   #+begin_src c :comments org :tangle (eval c) :noweb yes  :exports none
qmckl_exit_code
qmckl_set_nucleus_charge(qmckl_context context, const double* charge) {
  <<pre2>>

  int64_t num;
  qmckl_exit_code rc;

  int32_t mask = 1 << 1;

  rc = qmckl_get_nucleus_num(context, &num);
  if (rc != QMCKL_SUCCESS) return rc;
  
  if (ctx->nucleus.charge != NULL) {
    qmckl_free(context, ctx->nucleus.charge);
    ctx->nucleus.charge= NULL;
  }

  qmckl_memory_info_struct mem_info = qmckl_memory_info_struct_zero;
  mem_info.size = num*sizeof(double);

  assert (ctx->nucleus.charge == NULL);
  ctx->nucleus.charge = (double*) qmckl_malloc(context, mem_info);
  if (charge== NULL) {
    return qmckl_failwith( context,
                           QMCKL_ALLOCATION_FAILED,
                           "qmckl_set_nucleus_charge",
                           NULL);
  }
  ctx->nucleus.charge= memcpy(ctx->nucleus.charge, charge, num*sizeof(double));
  assert (ctx->nucleus.charge != NULL);
  
  <<post2>>
}
    #+end_src

    The following function sets the nuclear coordinates of all the
    atoms. The coordinates should be given in atomic units.

   #+begin_src c :comments org :tangle (eval c) :noweb yes  :exports none
qmckl_exit_code
qmckl_set_nucleus_coord(qmckl_context context, const double* coord) {
  <<pre2>>

  int64_t num;
  qmckl_exit_code rc;

  int32_t mask = 1 << 2;

  rc = qmckl_get_nucleus_num(context, &num);
  if (rc != QMCKL_SUCCESS) return rc;
  
  if (ctx->nucleus.coord != NULL) {
    qmckl_free(context, ctx->nucleus.coord);
    ctx->nucleus.coord = NULL;
  }

  qmckl_memory_info_struct mem_info = qmckl_memory_info_struct_zero;
  mem_info.size = 3*num*sizeof(double);

  assert(ctx->nucleus.coord == NULL);

  ctx->nucleus.coord = (double*) qmckl_malloc(context, mem_info);
  if (coord == NULL) {
    return qmckl_failwith( context,
                           QMCKL_ALLOCATION_FAILED,
                           "qmckl_set_nucleus_coord",
                           NULL);
  }
  ctx->nucleus.coord = memcpy(ctx->nucleus.coord, coord, 3*num*sizeof(double));
  assert (ctx->nucleus.coord != NULL);
  
  <<post2>>
}
    #+end_src

** Test

    #+begin_src c :tangle (eval c_test)
/* Reference input data */

#define num ((int64_t) 9)

double charge[num] = { 6., 6., 6., 7., 7., 1., 1., 1., 1. };

double coord[3*num] =
    { 4.166279566732572e-01,  -1.526183863767697e+00,   1.041604719335635e+00,
     -1.903457631371503e+00,   2.242154435363994e+00,   6.550163404813796e-01,
     -3.575005445908036e+00,  -3.063638942318878e+00,   2.086739409279095e+00,
      2.060062599100338e+00,  -1.623431626827498e+00,  -1.930074272670425e+00,
      9.491495662916423e-01,   3.808343139803397e-01,   4.077482772289367e+00,
      1.841031662652821e+00,  -2.945591662994877e+00,  -3.670011011125464e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00};
   
/* --- */

qmckl_exit_code rc;

assert(!qmckl_nucleus_provided(context));

int64_t n;
rc = qmckl_get_nucleus_num (context, &n);
assert(rc == QMCKL_NOT_PROVIDED);


rc = qmckl_set_nucleus_num (context, num);
assert(rc == QMCKL_SUCCESS);
assert(!qmckl_nucleus_provided(context));

rc = qmckl_get_nucleus_num (context, &n);
assert(rc == QMCKL_SUCCESS);
assert(n == num);

double coord2[3*num];

rc = qmckl_get_nucleus_coord (context, coord2);
assert(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_coord (context, coord);
assert(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_coord (context, coord2);
assert(rc == QMCKL_SUCCESS);
for (size_t i=0 ; i<3*num ; ++i) {
  assert( coord[i] == coord2[i] );
 }

assert(!qmckl_nucleus_provided(context));

double charge2[num];

rc = qmckl_get_nucleus_charge(context, charge2);
assert(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_charge(context, charge);
assert(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_charge(context, charge2);
assert(rc == QMCKL_SUCCESS);
for (size_t i=0 ; i<num ; ++i) {
  assert( charge[i] == charge2[i] );
 }
assert(qmckl_nucleus_provided(context));
    #+end_src

* Computation

  The computed data is stored in the context so that it can be reused
  by different kernels. To ensure that the data is valid, for each
  computed data the date of the context is stored when it is computed.
  To know if some data needs to be recomputed, we check if the date of
  the dependencies are more recent than the date of the data to
  compute. If it is the case, then the data is recomputed and the
  current date is stored.

** Nucleus-nucleus distances

*** Get

    #+begin_src c :comments org :tangle (eval h_func) :noweb yes
qmckl_exit_code qmckl_get_nucleus_nn_distance(qmckl_context context, double* distance);
    #+end_src

    #+begin_src c :comments org :tangle (eval c) :noweb yes  :exports none
qmckl_exit_code qmckl_get_nucleus_nn_distance(qmckl_context context, double* distance)
{
  /* Check input parameters */
  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return (char) 0;
  }

  qmckl_exit_code rc = qmckl_provide_nn_distance(context);
  if (rc != QMCKL_SUCCESS) return rc;

  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);

  size_t sze = ctx->nucleus.num * ctx->nucleus.num;
  memcpy(distance, ctx->nucleus.nn_distance, sze * sizeof(double));

  return QMCKL_SUCCESS;
}
    #+end_src

*** Provide                                                        :noexport:

    #+begin_src c :comments org :tangle (eval h_private_func) :noweb yes :exports none
qmckl_exit_code qmckl_provide_nn_distance(qmckl_context context);
    #+end_src

    #+begin_src c :comments org :tangle (eval c) :noweb yes  :exports none
qmckl_exit_code qmckl_provide_nn_distance(qmckl_context context)
{
  /* Check input parameters */
  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    return (char) 0;
  }
  
  qmckl_context_struct* const ctx = (qmckl_context_struct* const) context;
  assert (ctx != NULL);
  
  if (!ctx->nucleus.provided) return QMCKL_NOT_PROVIDED;
  
  /* Allocate array */
  if (ctx->nucleus.nn_distance == NULL) {
    
    qmckl_memory_info_struct mem_info = qmckl_memory_info_struct_zero;
    mem_info.size = ctx->nucleus.num * ctx->nucleus.num * sizeof(double);
    double* nn_distance = (double*) qmckl_malloc(context, mem_info);
    
    if (nn_distance == NULL) {
      return qmckl_failwith( context,
                             QMCKL_ALLOCATION_FAILED,
                             "qmckl_nn_distance",
                             NULL);
    }
    ctx->nucleus.nn_distance = nn_distance;
  }

  qmckl_exit_code rc =
    qmckl_compute_nn_distance(context,
                              ctx->nucleus.num,
                              ctx->nucleus.coord,
                              ctx->nucleus.nn_distance);
  if (rc != QMCKL_SUCCESS) {
    return rc;
  }

  ctx->nucleus.nn_distance_date = ctx->date;

  return QMCKL_SUCCESS;
}
    #+end_src

