qmckl_nucleus.html

<div id="outline-container-orgea7e904" class="outline-3">
<h3 id="orgea7e904"><span class="section-number-3">1.3</span> Initialization functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To set the data relative to the nuclei in the context, the
following functions need to be called.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>  <span style="color: #0000ff;">qmckl_set_nucleus_num</span>    (<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">num</span>);
<span style="color: #228b22;">qmckl_exit_code</span>  <span style="color: #0000ff;">qmckl_set_nucleus_charge</span> (<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">charge</span>);
<span style="color: #228b22;">qmckl_exit_code</span>  <span style="color: #0000ff;">qmckl_set_nucleus_coord</span>  (<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">coord</span>);
</pre>
</div>

<p>
To set the number of nuclei, use
</p>

<p>
The following function sets the nuclear charges of all the atoms. 
</p>

<p>
The following function sets the nuclear coordinates of all the
atoms. The coordinates should be given in atomic units.
</p>
</div>
</div>

<div id="outline-container-org203c8f5" class="outline-3">
<h3 id="org203c8f5"><span class="section-number-3">1.4</span> Test</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Reference input data </span>*/

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">num</span> ((<span style="color: #228b22;">int64_t</span>) 9)

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">charge</span>[num] = { 6., 6., 6., 7., 7., 1., 1., 1., 1. };

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">coord</span>[3*num] =
    { 4.166279566732572e-01,  -1.526183863767697e+00,   1.041604719335635e+00,
     -1.903457631371503e+00,   2.242154435363994e+00,   6.550163404813796e-01,
     -3.575005445908036e+00,  -3.063638942318878e+00,   2.086739409279095e+00,
      2.060062599100338e+00,  -1.623431626827498e+00,  -1.930074272670425e+00,
      9.491495662916423e-01,   3.808343139803397e-01,   4.077482772289367e+00,
      1.841031662652821e+00,  -2.945591662994877e+00,  -3.670011011125464e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00,
      0.000000000000000e+00,   0.000000000000000e+00,   0.000000000000000e+00};

/* <span style="color: #b22222;">--- </span>*/

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span>;

assert(!qmckl_nucleus_provided(context));

<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span>;
rc = qmckl_get_nucleus_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);


rc = qmckl_set_nucleus_num (context, num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
assert(!qmckl_nucleus_provided(context));

rc = qmckl_get_nucleus_num (context, &amp;n);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(n == num);

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">coord2</span>[3*num];

rc = qmckl_get_nucleus_coord (context, coord2);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_coord (context, coord);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_coord (context, coord2);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;3*num ; ++i) {
  assert( coord[i] == coord2[i] );
 }

assert(!qmckl_nucleus_provided(context));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">charge2</span>[num];

rc = qmckl_get_nucleus_charge(context, charge2);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_charge(context, charge);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_charge(context, charge2);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;num ; ++i) {
  assert( charge[i] == charge2[i] );
 }
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_nucleus_provided</span>(<span style="color: #a0522d;">context</span>));
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga0d3283" class="outline-2">
<h2 id="orga0d3283"><span class="section-number-2">2</span> Computation</h2>
<div class="outline-text-2" id="text-2">
<p>
The computed data is stored in the context so that it can be reused
by different kernels. To ensure that the data is valid, for each
computed data the date of the context is stored when it is computed.
To know if some data needs to be recomputed, we check if the date of
the dependencies are more recent than the date of the data to
compute. If it is the case, then the data is recomputed and the
current date is stored.
</p>
</div>
