qmckl_nucleus.html

<div id="outline-container-org6cd5f26" class="outline-3">
<h3 id="org6cd5f26"><span class="section-number-3">2.1</span> Nucleus-nucleus distances</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgcd546bf" class="outline-4">
<h4 id="orgcd546bf"><span class="section-number-4">2.1.1</span> Get</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_get_nucleus_nn_distance</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">distance</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org85b7eb4" class="outline-4">
<h4 id="org85b7eb4"><span class="section-number-4">2.1.2</span> Compute</h4>
<div class="outline-text-4" id="text-2-1-2">
<table id="org4a31db3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">nucl<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of nuclei</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">coord[3][nucl<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Nuclear coordinates (au)</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">nn<sub>distance</sub>[nucl<sub>num</sub>][nucl<sub>num</sub>]</td>
<td class="org-left">out</td>
<td class="org-left">Nucleus-nucleus distances (au)</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_compute_nn_distance_f</span><span style="color: #000000; background-color: #ffffff;">(context, nucl_num, coord, nn_distance)</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> nucl_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> coord(nucl_num,3)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> nn_distance(nucl_num,nucl_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> k</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  info = qmckl_distance(context, <span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'T'</span>, nucl_num, nucl_num, <span style="color: #a020f0;">&amp;</span>
          coord, nucl_num, <span style="color: #a020f0;">&amp;</span>
          coord, nucl_num, <span style="color: #a020f0;">&amp;</span>
          nn_distance, nucl_num)

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_nn_distance_f</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org48a2dd8" class="outline-4">
<h4 id="org48a2dd8"><span class="section-number-4">2.1.3</span> Test</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Reference input data </span>*/

<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_nucleus_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">distance</span>[num*num];
rc = qmckl_get_nucleus_nn_distance(context, distance);
rc = qmckl_get_nucleus_nn_distance(context, distance);
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">distance</span>[0] == 0.);
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">distance</span>[1] == distance[num]);
<span style="color: #0000ff;">assert</span>(abs(<span style="color: #228b22;">distance</span>[1]-4.164450441785663) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf571366" class="outline-3">
<h3 id="orgf571366"><span class="section-number-3">2.2</span> Nuclear repulsion energy</h3>
<div class="outline-text-3" id="text-2-2">
<p>
\[
   V_{NN} = \sum_{A=1}^{N-1} \sum_{B>A}^N \frac{Q_A Q_B}{R_{AB}}
   \]
</p>
</div>

<div id="outline-container-orgc9f40da" class="outline-4">
<h4 id="orgc9f40da"><span class="section-number-4">2.2.1</span> Get</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_get_nucleus_repulsion</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">energy</span>);
</pre>
</div>
</div>
</div>
