qmckl_nucleus.html

<div id="outline-container-org63cabf9" class="outline-4">
<h4 id="org63cabf9"><span class="section-number-4">2.2.2</span> Compute</h4>
<div class="outline-text-4" id="text-2-2-2">
<table id="org124e520" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">int64<sub>t</sub></td>
<td class="org-left">nucl<sub>num</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of nuclei</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">charge[nucl<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Nuclear charges (au)</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">nn<sub>distance</sub>[nucl<sub>num</sub>][nucl<sub>num</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Nucleus-nucleus distances (au)</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">energy</td>
<td class="org-left">out</td>
<td class="org-left">Nuclear repulsion energy</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_compute_nucleus_repulsion_f</span><span style="color: #000000; background-color: #ffffff;">(context, nucl_num, charge, nn_distance, energy)</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> nucl_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> charge(nucl_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> nn_distance(nucl_num,nucl_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> energy</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i, j</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  energy = 0.d0
  <span style="color: #a020f0;">do</span> j=2, nucl_num
     <span style="color: #a020f0;">do</span> i=1, j-1
        energy = energy + charge(i) * charge(j) / nn_distance(i,j) 
     <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">print</span> *, energy

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_nucleus_repulsion_f</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge762106" class="outline-4">
<h4 id="orge762106"><span class="section-number-4">2.2.3</span> Test</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Reference input data </span>*/

<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_nucleus_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">rep</span>;
rc = qmckl_get_nucleus_repulsion(context, &amp;rep);
<span style="color: #0000ff;">assert</span>(rep - 163.50434957121263 &lt; 1.e-10);

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-05-15 Sat 23:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
